constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}

combustionModel none;


EDMCoeffs
{
    semiImplicit    no;
    Cd              1;
    CEDC            1;
}

active          off;
