constant/g
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];  // m/s^2

value           (0 -9.81 0);       // Gravity in Y direction (negative)
