constant/reactions
FoamFile
{
    version     2.0;
    format      ascii;
    class       chemistryModel;
    location    "constant";
    object      reactions;
}

chemistryModel  none;

species         (H2 O2 N2);

reactions       ();
