system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}
scale 1.0;

vertices
(
    (0 0 0)
    (80 0 0)
    (80 20 0)
    (0 20 0)
    (0 0 30)
    (80 0 30)
    (80 20 30)
    (0 20 30)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 60) simpleGrading (1 1 1)
);

boundary
(
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    bottomWall { type wall;  faces ((0 1 5 4)); }
    top    { type patch; faces ((3 7 6 2)); }
    back  { type patch; faces ((0 3 2 1)); }
    front   { type patch; faces ((4 5 6 7)); }
);

mergePatchPairs ();
